AWS/EC2/EC2-run-instances.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-22 水 13:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4c11ae1">1. 〈EC2 インスタンス作成〉</a>
<ul>
<li><a href="#org6b7f4b9">1.1. 前提</a></li>
<li><a href="#orgc79cc3f">1.2. チェックリスト</a></li>
<li><a href="#org4c398ba">1.3. テンプレートファイルの内容について把握する</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4c11ae1" class="outline-2">
<h2 id="org4c11ae1"><span class="section-number-2">1</span> 〈EC2 インスタンス作成〉</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6b7f4b9" class="outline-3">
<h3 id="org6b7f4b9"><span class="section-number-3">1.1</span> 前提</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>OS は Amazon Linux 2 。</li>
<li>あとからインスタンスタイプを変更する予定がある。</li>
</ul>
</div>
</div>
<div id="outline-container-orgc79cc3f" class="outline-3">
<h3 id="orgc79cc3f"><span class="section-number-3">1.2</span> チェックリスト</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Cloudformation テンプレートファイルを用意する。
<ul class="org-ul">
<li><a href="ec2_inspection_cloudformation_template.yaml">ec2_inspection_cloudformation_template.yaml</a></li>
</ul></li>
<li>Cloudformation スタックを作る。</li>
<li>Cloudformation スタックの変更セットを実行する。</li>
<li>スワップ領域を有効にする。
<ul class="org-ul">
<li>参考 <a href="https://xtech.nikkei.com/it/article/COLUMN/20130909/503312/">https://xtech.nikkei.com/it/article/COLUMN/20130909/503312/</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4c398ba" class="outline-3">
<h3 id="org4c398ba"><span class="section-number-3">1.3</span> テンプレートファイルの内容について把握する</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>パラメータ Ec2ImageId
<ul class="org-ul">
<li>デフォルトで指定してある id は 2023-02-15 時点で最新の Amazon Linux 2 のAMI ID 。</li>
<li>今後変わる可能性がある。</li>
<li>スタック実行時点で動的に最新の Amazon Linux 2 の AMI ID を取得する方法もあるが、ここでは採用しない。
<ul class="org-ul">
<li>スタック実行時点で動的に最新の Amazon Linux 2 の AMI ID を取得する方法を採用したい場合はここを参照。
<a href="https://dev.classmethod.jp/articles/get-the-latest-amazon-linux-2-ami-id-with-cloudformation/">https://dev.classmethod.jp/articles/get-the-latest-amazon-linux-2-ami-id-with-cloudformation/</a></li>
</ul></li>
</ul></li>
<li>パラメータ KeyName
<ul class="org-ul">
<li>スタック実行時点でキーペアを選択する。</li>
</ul></li>
<li>パラメータ EC2Name
<ul class="org-ul">
<li>スタック実行時点で EC2 インスタンス Name 文字列を入力する。</li>
</ul></li>
<li>パラメータ EnvName
<ul class="org-ul">
<li>開発用、ステージング用、プロダクション用など用途ごとに使い分けるために用いる。</li>
<li>選択肢を増やしたら、 Mappings にも対応する値を増やす必要がある。</li>
</ul></li>
<li>Mappings SecurityGroup に記した値はダミー。実在する値に書き換える必要がある。</li>
<li>Mappings SubnetId に記した値はダミー。実在する値に書き換える必要がある。</li>
<li>EBS のボリュームサイズを変更したい場合はここを書き換える。 VolumeSize: 30</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-22 水 13:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
